# Practice 1

**loc[] : it is used to access the specific column by just writing the name insted of the index values in it**

In [9]:
import pandas as pd
from matplotlib import pyplot as plt
# Creating a dataframe
df = pd.read_csv('D:\\python Programming\\DataSets\\data_jobs.csv')
# Data Cleaning
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [10]:
df.loc[:,'salary_year_avg':'salary_hour_avg'].dropna(subset = 'salary_year_avg')

        salary_year_avg  salary_hour_avg
28             109500.0              NaN
77             140000.0              NaN
92             120000.0              NaN
100            228222.0              NaN
109             89000.0              NaN
...                 ...              ...
785624         139216.0              NaN
785641         150000.0              NaN
785648         221875.0              NaN
785682         157500.0              NaN
785692         157500.0              NaN

[22003 rows x 2 columns]

**fillna() : This Method is used to fill values in the nan cells of the data**

In [13]:
df_filled = df

In [17]:
salary_year_median = df['salary_year_avg'].median()
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_median)

**drop_duplicate() : This method is used to drop out duplicated values**

In [20]:
df_unique = df_filled
df_unique = df_unique.drop_duplicates()
print('Number of rows in Original Frame : ',len(df_filled))
print('Number of rows in unique Frame : ',len(df_unique))
print('Number of colunm dropped : ',len(df_filled) - len(df_unique))

Number of rows in Original Frame :  785741
Number of rows in unique Frame :  785640
Number of colunm dropped :  101

**The drop_duplicates() can also have some parameters as like colunm name as Subset**

In [22]:
df_unique = df_unique.drop_duplicates(subset = ['job_title','company_name'])
print('Number of rows in Original Frame : ',len(df_filled))
print('Number of rows in unique Frame : ',len(df_unique))
print('Number of colunm dropped : ',len(df_filled) - len(df_unique))

Number of rows in Original Frame :  785741
Number of rows in unique Frame :  508042
Number of colunm dropped :  277699

**sample(x,random_state = 42) : it is used to provide us the rows which gives us more idea about the data i.e it returns the random index number of the rows**

In [26]:
df.sample(5,random_state = 42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,NaN,115000.0,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,NaN,115000.0,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,NaN,115000.0,NaN,Morgan King,NaN,NaN
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,NaN,115000.0,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,NaN,115000.0,NaN,Independent Recruiters,['python'],{'programming': ['python']}

In [27]:
df_altered = df.copy()

In [31]:
print(id(df_altered))
print(id(df))
print(id(df) == id(df_altered))

3193321114512
3193308300304
False

## Pivot Tables in Pandas

Pivot tables in Python are typically created using the pandas library. They help summarize and analyze data by reorganizing it — especially useful for grouping, aggregating, and comparing values across categories.

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 785741 entries, 0 to 785740
Data columns (total 17 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   job_title_short        785741 non-null  object
 1   job_title              785740 non-null  object
 2   job_location           784696 non-null  object
 3   job_via                785733 non-null  object
 4   job_schedule_type      773074 non-null  object
 5   job_work_from_home     785741 non-null  bool
 6   search_location        785741 non-null  object
 7   job_posted_date        785741 non-null  datetime64[ns]
 8   job_no_degree_mention  785741 non-null  bool
 9   job_health_insurance   785741 non-null  bool
 10  job_country            785692 non-null  object
 11  salary_rate            33067 non-null   object
 12  salary_year_avg        785741 non-null  float64
 13  salary_hour_avg        10662 non-null   float64
 14  company_name           785723 non-null  object
 15  job_skills             668704 non-null  object
 16  job_type_skills        668704 non-null  object
dtypes: bool(3), datetime64[ns](1), float64(2), object(11)
memory usage: 86.2+ MB

In [61]:
top_countries = df['job_country'].value_counts().head(6).index
df_countries_pivot = df.pivot_table(
    values = 'salary_year_avg',
    index='job_country',
    columns='job_title_short',
    aggfunc='median'
)
df_countries_pivot = df_countries_pivot.loc[top_countries]
job_titles = ['Data Analyst','Cloud Engineer','Business Analyst']
df_countries_pivot = df_countries_pivot[job_titles]
df_countries_pivot
# df_countries_pivot.plot(kind = 'bar')

job_title_short  Data Analyst  Cloud Engineer  Business Analyst
job_country
United States        115000.0        115000.0          115000.0
India                115000.0        115000.0          115000.0
United Kingdom       115000.0        115000.0          115000.0
France               115000.0        115000.0          115000.0
Germany              115000.0        115000.0          115000.0
Spain                115000.0        115000.0          115000.0